/*
 * Click nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt 
to change this license
 */
package com.home.task_2_7_b_ru;
import java.io.*;
/**
 *
 * @author PC
 */
public class Program 
{
    public static void main(String[] args) throws Exception
    {
        int a; // Текущий код
        int b; // Целевой код
        int m = 0;  // Количество цифр целевого кода
        int n = 0;  // Количесво цифр текущего кода
        int total_moves = 0; // число перемещений дисков кодового замка
        int a1, b1; // Временные переменные для работы с комбинациями кодового замка
        //--Переменная для ввода строк с клавиатуры
        var stdin = new BufferedReader(new InputStreamReader(System.in));
        //--Ввод данных с клавиатуры: целевой и текущий код--
        //--Вводятся как четырехзначные числа--
        System.out.print("Введите текущий код: ");
        a = Integer.parseInt(stdin.readLine());
        System.out.print("Введите целевой код: ");
        b = Integer.parseInt(stdin.readLine());
        a1 = a; b1 = b;
        // Количество цифр текущего кода
        while (a1 > 0) // Условие выполнения цикла
        {
            m += 1; // Счётчик числа цифр увеличили на 1
            a1 /= 10; // Число уменьшили в 10 раз
        }
        // Количество цифр целевого кода
        while (b1 > 0) // Условие выполнения цикла
        {
            n += 1; // Счётчик числа цифр увеличили на 1
            b1 /= 10; // Число уменьшили в 10 раз
        }
        // Проверка на совпадение длины текущего и целевого кода
        // Если длина текущего кода не равна длине целевого
        // и оба кода не четырёхзначные, программа завершает работу.
        if ((m != 4) || (n != 4) || (m != n))
        {
            System.out.println("Комбинация кодового замка должна быть 4 цифры.");
            System.out.println("Текущий и целевой код должны быть одинаковой длины.");
            System.exit(0); // Выход из программы
        }
        a1 = a; b1 = b;
        // Перебор цифр текущего и целевого кода
        while ((a1 > 0) && (b1 > 0))
        {
            var d1 = a1 % 10;  // Цифра текущего кода
            var d2 = b1 % 10;  // Цифра целевого кода
            var diff1 = Math.abs(d1 - d2);  // разность цифр, прямой ход диска
            var diff2 = 10 - Math.abs(d1 - d2);  // разность цифр, обратный ход диска
            // Мнинимальное число ходов - разность между каждой цифрой диска
            // в целевом коде и текущем коде замка сейфа
            total_moves += Math.min(diff1, diff2);
            a1 /= 10;  // Переход к следующей цифре текущего кода
            b1 /= 10;  // Переход к следующей цифре целевого кода
        }
        // Вывод информации на экран
        System.out.println("Текущий код:" + a);
        System.out.println("Целевой код:" + b);
        System.out.println("Мнинимальное число ходов:" + total_moves);
    }
}
